app/controllers/api/sneakers_controller.rb

    def show
        @sneaker = Sneaker.find_by(id: params[:id])
---
SELECT  "sneakers".* FROM "sneakers" WHERE "sneakers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def index
        @sneakers = Sneaker.includes(photo_attachment: :blob).all
---
SELECT "sneakers".* FROM "sneakers"