app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom.base64
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "1zIGuIZ/Mf08snl8eyC4ZA=="], ["updated_at", "2020-04-27 22:52:54.328946"], ["id", 1]]